app/Controllers/Spk.php

UPDATE `kriteria` SET `id_kriteria` = '4', `slug` = 'c4', `kode_kriteria` = 'C4', `nama_kriteria` = 'Nilai Sikap', `bobot` = '0.25'
WHERE `kriteria`.`id_kriteria` IN ('4')
---
    public function save_kriteria()
    {


        $this->kriteria->save([
            'id_kriteria'  => $this->request->getVar('id_kriteria'),
            'slug'  => $this->request->getVar('slug'),
            'kode_kriteria'  => $this->request->getVar('kode_kriteria'),
            'nama_kriteria'  => $this->request->getVar('nama_kriteria'),
            'bobot'          => $this->request->getVar('bobot'),

        ]);