app/Models/KriteriaModel.php

    public function getData($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
---
SELECT *
FROM `kriteria`